In [1]:
import pandas as pd
import sqlite3

In [2]:
Team_Salaries = pd.read_csv("../CapstoneProject/TeamSalaryData.csv")

In [3]:
conn = sqlite3.connect("TeamSalaryData.db")

In [4]:
Team_Salaries.to_sql('Team_Salaries', conn)

/opt/tljh/user/lib/python3.6/site-packages/pandas/core/generic.py:2130: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  dtype=dtype)

ValueError: Table 'Team_Salaries' already exists.

In [5]:
sql_query = 'SELECT * FROM Team_Salaries'
Team_Salaries = pd.read_sql(sql_query, conn)
print(Team_Salaries)

     index  Team   Year          Payroll Win WS
0        0    BOS  2018    $227,398,860     Yes
1        1    CHC  2018    $193,259,933      No
2        2    NYY  2018    $180,098,151      No
3        3    LAD  2018    $199,582,045      No
4        4    SFG  2018    $205,665,348      No
5        5    WSN  2018    $181,382,609      No
6        6    HOU  2018    $163,524,216      No
7        7    STL  2018    $163,784,989      No
8        8    NYM  2018    $150,187,987      No
9        9    LAA  2018    $173,784,989      No
10      10    SEA  2018    $160,993,827      No
11      11    COL  2018    $143,968,544      No
12      12    PHI  2018    $104,297,471      No
13      13    TEX  2018    $140,625,018      No
14      14    CIN  2018    $100,305,768      No
15      15    MIL  2018    $108,982,016      No
16      16    ARI  2018    $143,324,597      No
17      17    DET  2018    $130,959,889      No
18      18    CLE  2018    $142,804,703      No
19      19    MIN  2018    $115,509,520      No
20      20    ATL  2018    $130,649,395      No
21      21    TOR  2018    $150,946,147      No
22      22    SDP  2018    $103,843,635      No
23      23    KCR  2018    $129,944,821      No
24      24    CHW  2018     $71,839,808      No
25      25    OAK  2018     $80,315,288      No
26      26    PIT  2018     $91,025,861      No
27      27    MIA  2018     $91,817,860      No
28      28    BAL  2018    $130,467,027      No
29      29    TBR  2018     $68,810,167      No
..     ...    ...   ...              ...    ...
528    528    CHC  2001     $64,015,833      No
529    529    NYY  2001    $109,791,893      No
530    530    LAD  2001    $108,980,952      No
531    531    SFG  2001     $63,332,667      No
532    532    WSN  2001     $34,774,500      No
533    533    HOU  2001     $60,382,667      No
534    534    STL  2001     $77,270,855      No
535    535    NYM  2001     $93,174,428      No
536    536    LAA  2001     $46,568,180      No
537    537    SEA  2001     $75,652,500      No
538    538    COL  2001     $71,068,000      No
539    539    PHI  2001     $41,664,167      No
540    540    TEX  2001     $88,504,421      No
541    541    CIN  2001     $45,227,882      No
542    542    MIL  2001     $43,089,333      No
543    543    ARI  2001     $81,206,513     Yes
544    544    DET  2001     $49,831,167      No
545    545    CLE  2001     $91,974,979      No
546    546    MIN  2001     $24,350,000      No
547    547    ATL  2001     $91,851,687      No
548    548    TOR  2001     $75,798,500      No
549    549    SDP  2001     $38,333,117      No
550    550    KCR  2001     $35,643,000      No
551    551    CHW  2001     $62,363,000      No
552    552    OAK  2001     $33,810,750      No
553    553    PIT  2001     $52,698,333      No
554    554    MIA  2001     $35,504,167      No
555    555    BAL  2001     $72,426,328      No
556    556    TBR  2001     $54,951,602      No
557    557  Total  2001  $1,933,800,329      No

[558 rows x 5 columns]

In [7]:
sql_query = 'SELECT * FROM Team_Salaries WHERE "Win WS" = "Yes"'
Team_Salaries = pd.read_sql(sql_query, conn)
print(Team_Salaries)

    index Team   Year        Payroll Win WS
0       0   BOS  2018  $227,398,860     Yes
1      37   HOU  2017  $138,709,677     Yes
2      63   CHC  2016  $184,352,494     Yes
3     116   KCR  2015  $126,529,835     Yes
4     128   SFG  2014  $171,336,782     Yes
5     155   BOS  2013  $170,734,264     Yes
6     190   SFG  2012  $137,523,205     Yes
7     224   STL  2011  $116,857,312     Yes
8     252   SFG  2010   $97,828,833     Yes
9     281   NYY  2009  $201,449,289     Yes
10    322   PHI  2008   $98,269,880     Yes
11    341   BOS  2007  $143,026,214     Yes
12    379   STL  2006   $88,891,371     Yes
13    427   CHW  2005   $75,228,000     Yes
14    434   BOS  2004  $125,208,542     Yes
15    492   MIA  2003   $49,050,000     Yes
16    505   LAA  2002   $61,721,667     Yes
17    543   ARI  2001   $81,206,513     Yes

In [12]:
sql_query = 'SELECT * FROM Team_Salaries WHERE Year = 2018 ORDER BY Payroll DESC'
Team_Salaries = pd.read_sql(sql_query, conn)
print(Team_Salaries)

    index  Team   Year          Payroll Win WS
0      27    MIA  2018     $91,817,860      No
1      26    PIT  2018     $91,025,861      No
2      25    OAK  2018     $80,315,288      No
3      24    CHW  2018     $71,839,808      No
4      29    TBR  2018     $68,810,167      No
5      30  Total  2018  $4,180,100,489      No
6       0    BOS  2018    $227,398,860     Yes
7       4    SFG  2018    $205,665,348      No
8       3    LAD  2018    $199,582,045      No
9       1    CHC  2018    $193,259,933      No
10      5    WSN  2018    $181,382,609      No
11      2    NYY  2018    $180,098,151      No
12      9    LAA  2018    $173,784,989      No
13      7    STL  2018    $163,784,989      No
14      6    HOU  2018    $163,524,216      No
15     10    SEA  2018    $160,993,827      No
16     21    TOR  2018    $150,946,147      No
17      8    NYM  2018    $150,187,987      No
18     11    COL  2018    $143,968,544      No
19     16    ARI  2018    $143,324,597      No
20     18    CLE  2018    $142,804,703      No
21     13    TEX  2018    $140,625,018      No
22     17    DET  2018    $130,959,889      No
23     20    ATL  2018    $130,649,395      No
24     28    BAL  2018    $130,467,027      No
25     23    KCR  2018    $129,944,821      No
26     19    MIN  2018    $115,509,520      No
27     15    MIL  2018    $108,982,016      No
28     12    PHI  2018    $104,297,471      No
29     22    SDP  2018    $103,843,635      No
30     14    CIN  2018    $100,305,768      No